package com.offer.dingzhi.util;

public interface OfferConst {

	//城市名称，省code，城市code
	public static  String[][] CITYS = {
		{"杭州","330000","330100"},
		{"北京","110000","110100"},
		{"天津","120000","120100"},
		{"上海","310000","310100"},
		{"南京","320000","320100"},
		{"广州","440000","440100"},
		{"武汉","420000","420100"},
		{"成都","510000","510100"},
		{"重庆","500000","500100"},
		{"合肥","340000","340100"},
		{"西安","610000","610000"},
		{"哈尔滨","230000","230100"},
		{"大连","210000","210200"},
		{"长沙","430000","430100"}
	};
	//全称，简称，城市代码，是否是地方计算机知名院校
	public static String[][] US = {
		
		//杭州的大学
		{"浙江大学","浙大","330100","1"},
		{"杭州电子科技大学","杭电","330100","1"},
		{"浙江工业大学","浙工大","330100","0"},
		{"浙江理工大学","浙理工","330100","0"},
		{"浙江工商大学","浙江工商","330100","0"},
		{"浙江师范大学","浙江师范","330100","0"},
		{"杭州师范大学","杭州师范","330100","0"},

		//北京的大学
		{"北京大学","北大","110100","1"},
		{"清华大学","清华","110100","1"},
		{"北京航天航空大学","北航","110100","0"},
		{"北京邮电大学","北邮","110100","0"},
		{"中国人民大学","人大","110100","0"},
		{"北京理工大学","北理","110100","0"},
		{"中国科学院","中科院","110100","0"},

		//天津的大学
		{"天津大学","天大","120100","1"},
		{"南开大学","南大","120100","1"},
		{"河北工业大学","河工大","120100","0"},
		{"天津理工大学","天津理工","120100","0"},
		{"天津科技大学","天津科技","120100","0"},
		{"天津工业大学","天津工业","120100","0"},
		{"中国民航大学","中国民航","120110","0"},
		
		//上海的大学
		{"复旦大学","复旦","310100","1"},
		{"上海交通大学","上交大","310100","1"},
		{"同济大学","同济","310100","0"},
		{"华东理工大学","华东理工","310100","0"},
		{"华东师范大学","华东师范","310100","0"},
		{"上海财经大学","上财","310100","0"},
		{"上海大学","上海大学","310100","0"},
		
		//南京的大学
		{"南京大学","南大","320100","1"},
		{"东南大学","东南大学","320100","1"},
		{"南京航天航空大学","南航","320100","0"},
		{"南京理工大学","南理","320100","0"},
		{"江南大学","江南大学","320100","0"},
		{"苏州大学","苏州大学","320100","0"},
		{"南京工业大学","南工大","320100","0"},
		
		//广州的大学
		{"中山大学","中山","440100","1"},
		{"华南理工大学","华南理工","440100","1"},
		{"暨南大学","暨南","440100","0"},
		{"广州大学","广州","440100","0"},
		{"华南师范大学","华南师大","440100","0"},
		{"华南农业大学","华南农大","440100","0"},
		{"汕头大学","汕头大学","440100","0"},
		
		//武汉的大学
		{"武汉大学","武大","420100","1"},
		{"华中科技大学","华科大","420100","1"},
		{"武汉理工大学","武汉理工","420100","0"},
		{"华中师范大学","华中师范","420100","0"},
		{"武汉工程大学","武汉工程","420100","0"},
		{"武汉科技大学","武汉科技","420100","0"},
		{"湖北大学","湖北大学","420100","0"},
		
		//成都的大学
		{"四川大学","川大","510100","1"},
		{"成都电子科技大学","电子科大","510100","1"},
		{"西南交通大学","西南交大","510100","0"},
		{"西南财经大学","西财","510100","0"},
		{"成都理工大学","成都理工","510100","0"},
		{"西南科技大学","西南科技","510100","0"},
		{"四川师范大学","川师大","510100","0"},
		
		//重庆的大学
		{"重庆大学","重大","500100","1"},
		{"重庆邮电大学","重邮","500100","1"},
		{"西南大学","西南大学","500100","0"},
		{"重庆交通大学","重交","500100","0"},
		{"重庆工商大学","重庆工商","500100","0"},
		{"重庆科技大学","重庆科技","500100","0"},
		{"重庆师范大学","重师大","500100","0"},
		
		//合肥的大学
		{"中国科学技术大学","","中科大","1"},
		{"安徽大学","安徽大学","340100","0"},
		{"合肥工业大学","合肥工业","340100","0"},
		{"安徽工业大学","安徽工业","340100","0"},
		{"安徽理工大学","安徽理工","340100","0"},
		//西安的大学
		{"西安交通大学","西安交大","610000","1"},
		{"西安电子科技大学","西安电子科技","610000","0"},
		{"西北大学","西北大学","610000","0"},
		{"陕西师范大学","陕西师大","610000","0"},
		{"西安理工大学","西安理工","610000","0"},
		{"西安工业大学","西安工业","610000","0"},
		//哈尔滨的大学
		{"哈尔滨工业大学","哈工大","230100","1"},
		{"哈尔滨工程大学","哈尔滨工程","230100","0"},
		{"东北农业大学","东北农业","230100","0"},
		{"东北林业大学","东北林业","230100","0"},
		{"黑龙江大学","黑龙江","230100","0"},
        //大连的大学		
		{"大连理工大学","大连理工","210200","1"},
		{"东北大学","东北大学","210200","0"},
		{"辽宁大学","辽宁大学","210200","0"},
		{"沈阳工业大学","沈阳工业","210200","0"},
		{"大连海事大学","大宁海事","210200","0"},
		//长沙的大学
		{"湖南大学","湖南","430100","1"},
		{"国防科技大学","国防科大","430100","1"},
		{"中南大学","中南","430100","0"},
		{"湖南师范大学","湖南师范","430100","0"},
		{"湘潭大学","湘潭","430100","0"},
		{"长沙理工大学","长沙理工","430100","0"},
	};
}
